cases/audi/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-34.59991 -30.0 -1.31852)
    (37.40009 -30.0 -1.31852)
    (37.40009 30.0 -1.31852)
    (-34.59991 30.0 -1.31852)

    (-34.59991 -30.0 35.68148)
    (37.40009 -30.0 35.68148)
    (37.40009 30.0 35.68148)
    (-34.59991 30.0 35.68148)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (72 60 37) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    blockMesh_frontWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
        inGroups (groupWall);
    }
    blockMesh_backWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
        inGroups (groupWall);
    }
    blockMesh_inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
        inGroups (groupWall);
    }
    blockMesh_outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
        inGroups (groupWall);
    }
    blockMesh_lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
        inGroups (groupWall);
    }
    blockMesh_upperWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
        inGroups (groupWall);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
