cases/audi/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
ddtSchemes
{
    default         steadyState;
}

divSchemes
{
    default          none;
    div(phi,U)       bounded Gauss linearUpwindV grad(U);
    div(phi,nuTilda) bounded Gauss limitedLinear 1.0;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
    grad(p)         Gauss linear;
}

fluxRequired
{
    default         no;
    p               ;
    Phi             ;
}

wallDist
{
    method          meshWave;
    nRequired       false;
}
